In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('titanic.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

1. Какое количество мужчин и женщин ехало на корабле? В качестве
ответа приведите два числа через пробел.

In [5]:
data['Sex'][data['Sex'] == 'male'].value_counts()

male    577
Name: Sex, dtype: int64

In [6]:
data['Sex'][data['Sex'] == 'female'].value_counts()

female    314
Name: Sex, dtype: int64

2. Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух
знаков.

In [11]:
survived = data['Survived'][data['Survived'] == 1].value_counts()
all_passengers = len(data['Survived'])
survival_rate = round(100 * survived / all_passengers, 2)
survival_rate

1    38.38
Name: Survived, dtype: float64

3. Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до
100, знак процента не нужен), округлив до двух знаков.

In [14]:
first_class_passengers = data['Pclass'][data['Pclass'] == 1].value_counts()
first_class_rate = round(100 * first_class_passengers / all_passengers, 2)
first_class_rate

1    24.24
Name: Pclass, dtype: float64

4. Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. Посчитайте среднее и медиану возраста
пассажиров. В качестве ответа приведите два числа через пробел.

In [16]:
mean_age = round(data['Age'].mean(), 2)
mean_age

29.7

In [17]:
median_age = round(data['Age'].median(), 2)
median_age

28.0

5. Коррелируют ли число братьев/сестер с числом родителей/детей?
Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [20]:
correlation = data[['SibSp', 'Parch']].corr(method='pearson')
correlation

          SibSp     Parch
SibSp  1.000000  0.414838
Parch  0.414838  1.000000

6. Какое самое популярное женское имя на корабле? Извлеките из
полного имени пассажира (колонка Name) его личное имя (First
Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и
шумные, но из них требуется извлечь необходимую информацию.
Попробуйте вручную разобрать несколько значений столбца Name
и выработать правило для извлечения имен, а также разделения
их на женские и мужские.

In [135]:
female_names = data['Name'][data['Sex'] == 'female']
female_names = pd.DataFrame(female_names)
female_names.reset_index(inplace = True)
female_names.drop('index', axis = 1, inplace = True)
female_names.loc[235]

Name    Sagesser, Mlle. Emma
Name: 235, dtype: object

In [140]:
first_names = []
for name in female_names['Name']:
    first_name = ""
    if ('(' in name) == True:
        bracket = name.find("(")
        space = name[bracket:].find(" ")
        if space != -1:
            first_name = name[bracket+1:bracket+space]
        else:
            first_name = name[bracket+1:-1]
    elif (('Miss.' in name) == True) or (('Mrs.' in name) == True) or (('Ms.' in name) == True) or \
    (('Mme.' in name) == True) or (('Mlle.' in name) == True):
        miss = name.find("Miss.")
        space1 = name[miss:].find(" ")
        space2 = name[miss+space1+1:].find(" ")
        if space2 != -1:
            first_name = name[miss+space1+1:miss+space1+space2+1]
        else:
            first_name = name[miss+space1+1:]
    first_names.append(first_name)
first_names = pd.DataFrame(first_names)

In [144]:
first_names[0].value_counts().idxmax()

'Anna'